IDEA Open Model
ISDType Enumeration
Compatible with IDEA StatiCa v 10.1
 Type of IDEA StatiCa Detail
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public enum ISDType
Public Enumeration ISDType
public enum class ISDType
Members
Member name | Value | Description
Wall | 0 |  Wall
Member1D | 1 |  Member1D
FrameJoint | 2 |  Frame joint
See Also
Reference
IdeaRS.OpenModel.Detail Namespace